Revit 2027 API
GlobalParameter.IsDrivenByDimension Property
 Indicates whether this parameter is driven by a dimension or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsDrivenByDimension { get; }
Public ReadOnly Property IsDrivenByDimension As Boolean
	Get
public:
property bool IsDrivenByDimension {
	bool get ();
}
member IsDrivenByDimension : bool with get
Property Value
Boolean
Remarks
Only reporting parameters can be driven by dimensions. Thus, to drive a parameter by a dimension, the parameter must first be set as reporting before it is used to label the driving dimension.
Note that the value of this property is always the opposite of the IsDrivenByFormula property. It is so because a parameter of which value is evaluated by a formula cannot be driven by a dimension, and vice versa.
See Also
Reference
GlobalParameter Class
Autodesk.Revit.DB Namespace